Diet-baseLogin/app/Controllers/ClientController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function dashboard()
    {
        $userId = session()->get('userId');
        $user = $this->userModel->find($userId);