Diet-baseLogin/app/Controllers/GoldController.php

    public function subscribe()
    {
        if (!$this->isLoggedIn()) {
            return redirect()->to('/login');
        }

        $userId = $this->session->get('userId');
        $user = $this->userModel->find($userId);

        // Récupérer les paramètres
        $prixGold = $this->parametreModel->where('cle', 'prix_gold')->first();
        $reductionGold = $this->parametreModel->where('cle', 'reduction_gold_pourcent')->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `parametres`
WHERE `cle` = 'prix_gold'
 LIMIT 1
SELECT *
FROM `parametres`
WHERE `cle` = 'reduction_gold_pourcent'
 LIMIT 1