Diet-baseLogin/app/Controllers/WalletController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function getBalance()
    {
        if (!$this->isLoggedIn()) {
            return $this->response->setJSON(['success' => false, 'message' => 'Non connecté']);
        }

        $userId = $this->session->get('userId');
        $user = $this->userModel->find($userId);