app/Controllers/ClientController.php

SELECT *
FROM `users`
WHERE `role` = 'client'
---
    public function index()
    {
        $clients = $this->userModel
            ->where('role', 'client')
            ->findAll();