app/Controllers/ClientController.php

    public function dashboard()
    {
        $userId = session()->get('userId');
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function index()
    {
        $clients = $this->userModel
            ->where('role', 'client')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'client'