app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `Personne`
---
    public function getStats()
    {
        return $this->response->setJSON([
            'total_utilisateurs' => $this->personneModel->countAll(),
            'imc_moyen' => $this->getIMCMoyen(),
            'distribution_objectifs' => $this->getDistributionObjectifs(),
            'calories_moyennes' => $this->getCaloriesMoyennes()
        ]);

SELECT *
FROM `Personne`
---
    public function utilisateurs()
    {
        $data = [
            'title' => 'Gestion des utilisateurs',
            'utilisateurs' => $this->personneModel->findAll()

SELECT AVG(`imc`) AS `imc`
FROM `Personne`
 LIMIT 1
---
    private function getIMCMoyen()
    {
        $result = $this->personneModel->selectAvg('imc')->first();

SELECT `o`.`nom` as `nom`, COUNT(*) as count
FROM `Personne`
LEFT JOIN `Objectifs` `o` ON `Personne`.`objectif_id` = `o`.`id`
GROUP BY `o`.`nom`
---
    private function getDistributionObjectifs()
    {
        return $this->personneModel
            ->select('o.nom as nom, COUNT(*) as count')
            ->join('Objectifs o', 'Personne.objectif_id = o.id', 'left')
            ->groupBy('o.nom')
            ->findAll();

SELECT `o`.`nom` as `nom`, AVG((Regimes.calories_min + Regimes.calories_max) / 2) as calories_moyennes
FROM `Regimes`
JOIN `Objectifs` `o` ON `Regimes`.`objectif_id` = `o`.`id`
GROUP BY `o`.`nom`
---
    private function getCaloriesMoyennes()
    {
        return $this->regimesModel
            ->select('o.nom as nom, AVG((Regimes.calories_min + Regimes.calories_max) / 2) as calories_moyennes')
            ->join('Objectifs o', 'Regimes.objectif_id = o.id')
            ->groupBy('o.nom')
            ->findAll();