app/Controllers/RegimeController.php

SELECT *
FROM `regimes`
---
    public function index()
    {
        if (!$this->isAdmin()) {
            return redirect()->to('/login');
        }

        $data['regimes'] = $this->regimeModel->findAll();